Glen-collab/polly-connect/firmware/polly-waveshare-s3/sdkconfig.defaults
# Waveshare ESP32-S3-AUDIO-Board config
# ESP32-S3R8 with 8MB OPI PSRAM, 16MB flash

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash - 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - 8MB Octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# Audio / I2S
CONFIG_I2S_ISR_IRAM_SAFE=y

# Performance
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# HTTP Server (captive portal)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# OTA updates
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
